package task7;

public class ForHundred {
    public static void main(String[] args) {

        for (int x = 1; x <= 100; x++) {
            System.out.println("x = " + x);
        }

    }
}

//Посчитать сумму чисел от 1..100 с помощью цикла for.
//Вывести сумму на экран.